## Exercise 7.1
### 1: Concatenating pandas Series along row axis

The DataFrames `jan`, `feb`, and` mar` have been pre-loaded.
Your job is to use `pd.concat()` to concatenate a list of Series.

In [1]:
import pandas as pd

# Load 'sales-jan-2015.csv' into a DataFrame: jan
jan = pd.read_csv('https://github.com/huangpen77/BUDT704/raw/main/Chapter08/Sales/sales-jan-2015.csv', parse_dates=True, index_col='Date')

# Load 'sales-feb-2015.csv' into a DataFrame: feb
feb = pd.read_csv('https://github.com/huangpen77/BUDT704/raw/main/Chapter08/Sales/sales-feb-2015.csv', parse_dates=True, index_col='Date')

# Load 'sales-mar-2015.csv' into a DataFrame: mar
mar = pd.read_csv('https://github.com/huangpen77/BUDT704/raw/main/Chapter08/Sales/sales-mar-2015.csv', parse_dates=True, index_col='Date')

# Extract the 'Units' column from jan: jan_units
jan_units = jan['Units']

# Extract the 'Units' column from feb: feb_units
feb_units = feb['Units']

# Extract the 'Units' column from mar: mar_units
mar_units = mar['Units']

display(jan_units.head(), feb_units.head(), mar_units.head())

Date
2015-01-21 19:13:21    11
2015-01-09 05:23:51     8
2015-01-06 17:19:34    17
2015-01-02 09:51:06    16
2015-01-11 14:51:02    11
Name: Units, dtype: int64

Date
2015-02-26 08:57:45     4
2015-02-16 12:09:19    10
2015-02-03 14:14:18    13
2015-02-02 08:33:01     3
2015-02-25 00:29:00    10
Name: Units, dtype: int64

Date
2015-03-22 14:42:25     6
2015-03-12 18:33:06    19
2015-03-22 03:58:28     8
2015-03-15 00:53:12    19
2015-03-17 19:25:37    10
Name: Units, dtype: int64

#### Instructions (3 points)

* Create a list `units` with 3 elements: `jan_units`, `feb_units`, and `mar_units`
* Concatenate the Series contained in the list `units` into a longer Series called `quarter1` using `pd.concat()`.
    * Specify the keyword argument `axis='rows'` to stack the Series vertically.
* Sort the index of `quarter1`, use `inplace=True` to apply the change to `quarter1`.

In [6]:
# create a list `units`
units = [jan_units, feb_units, mar_units]

# Concatenate the list: quarter1
quarter1 = pd.concat(units, axis='rows')
# Sort the index of `quarter1`, use `inplace=True`
quarter1.sort_index(inplace=True)

quarter1.info()

<class 'pandas.core.series.Series'>
DatetimeIndex: 60 entries, 2015-01-01 07:31:20 to 2015-03-28 19:20:38
Series name: Units
Non-Null Count  Dtype
--------------  -----
60 non-null     int64
dtypes: int64(1)
memory usage: 960.0 bytes

#### Instructions (1 point)
* Verify that `quarter1` has the individual Series stacked vertically by printing slices. First, try using the slice `'Jan 25, 2015':'Feb 5, 2015'`

In [7]:
# Print a slice from quarter1
print(quarter1.loc['Jan 25, 2015':'Feb 5, 2015'])

Date
2015-01-25 15:40:07     6
2015-01-26 01:50:25    14
2015-01-27 07:11:55    18
2015-02-02 08:33:01     3
2015-02-02 20:54:49     9
2015-02-03 14:14:18    13
2015-02-04 15:36:29    13
2015-02-04 21:52:45    14
2015-02-05 01:53:06    19
2015-02-05 22:05:03    10
Name: Units, dtype: int64

#### Instructions (1 point)
* pandas' syntax for dates is very flexible. This thime, print out a slice of `quarter1` using slice `'2/26/2015':'3/7/2015'`

In [8]:
# Print a slice from quarter1
print(quarter1.loc['2/26/2015':'3/7/2015'])

Date
2015-02-26 08:57:45     4
2015-02-26 08:58:51     1
2015-03-06 02:03:56    17
2015-03-06 10:11:45    17
Name: Units, dtype: int64

### 2: Concatenating pandas Series along column axis
#### Instructions (1 point)
- concat the 3 pandas Series `courses`, `fees` and `discount` along column axis into a DataFrame `df`

In [10]:
# Create Series by assigning names
courses = pd.Series(["Spark","PySpark","Hadoop"], name='courses')
fees = pd.Series([22000,25000,23000], name='fees')
discount  = pd.Series([1000,2300,1000], name='discount')

df=pd.concat([courses,fees,discount], axis='columns')
print(df)

   courses   fees  discount
0    Spark  22000      1000
1  PySpark  25000      2300
2   Hadoop  23000      1000

## Exercise 7.2
### 1: Concatenating DataFrames with the same columns

In this exercise, you'll use the [Baby Names Dataset](https://www.data.gov/developers/baby-names-dataset/) (from [data.gov](http://data.gov/)). Both DataFrames `names_1981` and `names_1881` are loaded without specifying an Index column (so the default Indexes for both are RangeIndexes).

In [11]:
import pandas as pd
names_1881 = pd.read_csv('https://github.com/huangpen77/BUDT704/raw/main/Chapter08/Baby%20names/names1881.csv', header=None, names=['name', 'gender', 'count'])
names_1981 = pd.read_csv('https://github.com/huangpen77/BUDT704/raw/main/Chapter08/Baby%20names/names1981.csv', header=None, names=['name', 'gender', 'count'])
names_1981.head()

       name gender  count
0  Jennifer      F  57032
1   Jessica      F  42519
2    Amanda      F  34370
3     Sarah      F  28162
4   Melissa      F  28003

#### Instructions (2 points)

* Create a `'year'` column in the DataFrames `names_1881` and `names_1981`, with values of `1881` and `1981` respectively. Recall that assigning a scalar value to a DataFrame column broadcasts that value throughout.
* Create a new DataFrame called `combined_names` by concatenating the rows of `names_1981` with the rows of `names_1881`. Specify the keyword argument `ignore_index=True` to make a new RangeIndex of unique integers for each row.
* Print the shapes of all three DataFrames. 
* Extract all rows from `combined_names` that have the name `'Morgan'`. To do this, use an appropriate filter. The relevant column of `combined_names` here is `'name'`.

In [20]:
# Add 'year' column to names_1881 and names_1981
names_1881['year'] = 1881
names_1981['year'] = 1981

# Concatenate `names_1981` with `names_1881` with `ignore_index=True`: combined_names
combined_names = pd.concat([names_1881,names_1981], ignore_index=True)

# Print shapes of names_1981, names_1881, and combined_names
print(names_1981.shape)
print(names_1881.shape)
print(combined_names.shape)

# Print all rows that contain the name 'Morgan'
combined_names[combined_names['name'] == 'Morgan']

(19455, 4)
(1935, 4)
(21390, 4)

         name gender  count  year
1283   Morgan      M     23  1881
2096   Morgan      F   1769  1981
14390  Morgan      M    766  1981

### 2: Concatenating pandas DataFrames along column axis

The function `pd.concat()` can concatenate DataFrames *horizontally* as well as *vertically* (vertical is the default). To make the DataFrames stack horizontally, you have to specify the keyword argument `axis=1` or` axis='columns'`.

In this exercise, you'll use weather data with maximum/minnimum and mean daily temperatures sampled at different rates (quarterly versus monthly). You'll concatenate the rows of both and see that, where rows are missing in the coarser DataFrame, null values are inserted in the concatenated DataFrame. This corresponds to an outer join (which you will explore in more detail in later exercises).

DataFrames `weather_range` and `weather_mean` are loaded for you, and `pandas` has been imported as `pd`.

In [21]:
weather_mean_data = {'Mean TemperatureF': [53.1, 70., 
                                           34.93548387, 
                                           28.71428571, 
                                           32.35483871, 
                                           72.87096774, 
                                           70.13333333, 
                                           35., 
                                           62.61290323, 
                                           39.8, 
                                           55.4516129 , 
                                           63.76666667],
                     'Month': ['Apr', 'Aug', 'Dec', 'Feb', 'Jan', 'Jul', 'Jun', 'Mar', 'May', 'Nov', 'Oct', 'Sep']}
weather_range_data = {'Max TemperatureF': [68, 89, 91, 84], 'Min TemperatureF': [18, 35, 64, 48], 'Month': ['Jan', 'Apr', 'Jul', 'Oct']}

weather_mean = pd.DataFrame.from_dict(weather_mean_data)
weather_mean.set_index('Month', inplace=True, drop=True)
weather_range = pd.DataFrame.from_dict(weather_range_data)
weather_range.set_index('Month', inplace=True, drop=True)
display(weather_range, weather_mean)

       Max TemperatureF  Min TemperatureF
Month
Jan                  68                18
Apr                  89                35
Jul                  91                64
Oct                  84                48

       Mean TemperatureF
Month
Apr            53.100000
Aug            70.000000
Dec            34.935484
Feb            28.714286
Jan            32.354839
Jul            72.870968
Jun            70.133333
Mar            35.000000
May            62.612903
Nov            39.800000
Oct            55.451613
Sep            63.766667

#### Instructions (2 points)

* Create a new DataFrame called `weather` by concatenating the DataFrames `weather_range` and `weather_mean` *horizontally*.
    * Pass the two DataFrames to `pd.concat()` as a list and specify the keyword argument `axis=1` to stack them horizontally, and sort the non-concatenation axis.

In [22]:
# Concatenate weather_max and weather_mean horizontally: weather
weather = pd.concat([weather_range,weather_mean], axis=1, sort=False)

# Print weather
weather

       Max TemperatureF  Min TemperatureF  Mean TemperatureF
Month
Jan                68.0              18.0          32.354839
Apr                89.0              35.0          53.100000
Jul                91.0              64.0          72.870968
Oct                84.0              48.0          55.451613
Aug                 NaN               NaN          70.000000
Dec                 NaN               NaN          34.935484
Feb                 NaN               NaN          28.714286
Jun                 NaN               NaN          70.133333
Mar                 NaN               NaN          35.000000
May                 NaN               NaN          62.612903
Nov                 NaN               NaN          39.800000
Sep                 NaN               NaN          63.766667

## Exercise 7.3
### 1: Concatenating vertically to get MultiIndexed rows

When stacking a sequence of DataFrames vertically, it is sometimes desirable to construct a MultiIndex to indicate the DataFrame from which each row originated. This can be done by specifying the `keys` parameter in the call to `pd.concat()`, which generates a hierarchical index with the labels from `keys` as the outermost index label. 

Here, you'll work with DataFrames compiled from [The Guardian's Olympic medal dataset](https://www.theguardian.com/sport/datablog/2012/jun/25/olympic-medal-winner-list-data). Once again, `pandas` has been imported as `pd` and two lists have been pre-loaded: An empty list called `medalDF_list`, and `medal_types`, which contains the strings `'bronze'`, `'silver'`, and `'gold'`.

#### Instructions (3 points)

* Within the `for` loop:
    * Read `file_name` into a DataFrame called `medal_df`. Specify the index to be `'Country'`.
    * Append `medal_df` to `medalDF_list`.
* Concatenate the list of DataFrames `medalDF_list` into a single DataFrame called `medals`. Be sure to use the keyword argument `keys=medal_types` to create a vertically stacked DataFrame with a MultiIndex.

In [23]:
import pandas as pd

# create an empty list, will be used to store mdeal dataframes
medalDF_list = []
# create a list of medal types
medal_types = ['bronze', 'silver', 'gold'] 

for medal in medal_types:
    # Create the file name: file_name
    file_name = f'https://github.com/huangpen77/BUDT704/raw/main/Chapter08/Summer%20Olympic%20medals/{medal}_top5.csv'
    # Read file_name into a DataFrame: medal_df
    medal_df = pd.read_csv(file_name, index_col='Country')
    # Append medal_df to medals
    medalDF_list.append(medal_df)

# Concatenate medals: medals
medals = pd.concat(medalDF_list, keys=medal_types)

# Print medals in entirety
print(medals)

                        Total
       Country
bronze United States   1052.0
       Soviet Union     584.0
       United Kingdom   505.0
       France           475.0
       Germany          454.0
silver United States   1195.0
       Soviet Union     627.0
       United Kingdom   591.0
       France           461.0
       Italy            394.0
gold   United States   2088.0
       Soviet Union     838.0
       United Kingdom   498.0
       Italy            460.0
       Germany          407.0

#### Instructions (1 point)
* print out the index of `medals` to see the MultiIndex.

In [24]:
# print out the index of `medals` 
medals.index

MultiIndex([('bronze',  'United States'),
            ('bronze',   'Soviet Union'),
            ('bronze', 'United Kingdom'),
            ('bronze',         'France'),
            ('bronze',        'Germany'),
            ('silver',  'United States'),
            ('silver',   'Soviet Union'),
            ('silver', 'United Kingdom'),
            ('silver',         'France'),
            ('silver',          'Italy'),
            (  'gold',  'United States'),
            (  'gold',   'Soviet Union'),
            (  'gold', 'United Kingdom'),
            (  'gold',          'Italy'),
            (  'gold',        'Germany')],
           names=[None, 'Country'])

#### Instructions (1 point)
* You probably noticed that the first level of the MultiIndex does not have a name. You can change that by naming the MultiIndex with names `['Medal Type', 'Country']`.

In [25]:
medals.index.names = ['Medal Type', 'Country']
print(medals)

                            Total
Medal Type Country
bronze     United States   1052.0
           Soviet Union     584.0
           United Kingdom   505.0
           France           475.0
           Germany          454.0
silver     United States   1195.0
           Soviet Union     627.0
           United Kingdom   591.0
           France           461.0
           Italy            394.0
gold       United States   2088.0
           Soviet Union     838.0
           United Kingdom   498.0
           Italy            460.0
           Germany          407.0

### 2: Slicing MultiIndexed DataFrames

You are provided with the MultiIndexed DataFrame as produced at the end of the preceding exercise. Your task is to sort the DataFrame and to use the `pd.IndexSlice` to extract specific slices. 
`pandas` has been imported for you as `pd` and the DataFrame `medals` is already in your namespace.

#### Instructions (3 points)

* Create a new DataFrame `medals_sorted` with the entries of `medals` sorted. Use `.sort_index(level=0)` to ensure the Index is sorted suitably.
* Print the number of bronze medals won by Germany.
* Print all of the silver medal data.
* Print all medals won by the United Kingdom
    * Create an alias for `pd.IndexSlice` called `idx`. A slicer `pd.IndexSlice` is required when slicing on the *inner* level of a MultiIndex.
    * Slice all the data on medals won by the United Kingdom. To do this, use the `.loc[]` accessor with `idx[:,'United Kingdom'], :`.

In [27]:
# Sort the entries of medals: medals_sorted
medals_sorted = medals.sort_index(level=0)

# Print the number of Bronze medals won by Germany
print(medals_sorted.loc[('bronze', 'Germany')])

Total    454.0
Name: (bronze, Germany), dtype: float64

In [28]:
# Print all data of silver medals
print(medals_sorted.loc['silver'])

                 Total
Country
France           461.0
Italy            394.0
Soviet Union     627.0
United Kingdom   591.0
United States   1195.0

In [29]:
# Create alias for pd.IndexSlice: idx
idx = pd.IndexSlice

# Print all medals won by the United Kingdom
medals_sorted.loc[idx[:,'United Kingdom'], :]

                           Total
Medal Type Country
bronze     United Kingdom  505.0
gold       United Kingdom  498.0
silver     United Kingdom  591.0

## Exercise 7.4
### 1: Concatenating DataFrames with inner join

Here, you'll continue working with DataFrames compiled from [The Guardian's Olympic medal dataset](https://www.theguardian.com/sport/datablog/2012/jun/25/olympic-medal-winner-list-data).

The DataFrames `bronze`, `silver`, and `gold` have been pre-loaded for you.

Your task is to compute an inner join using `pd.concat()`.

In [30]:
import pandas as pd

bronze = pd.read_csv('https://github.com/huangpen77/BUDT704/raw/main/Chapter08/Summer%20Olympic%20medals/bronze_top5.csv', index_col='Country')
silver = pd.read_csv('https://github.com/huangpen77/BUDT704/raw/main/Chapter08/Summer%20Olympic%20medals/silver_top5.csv', index_col='Country')
gold = pd.read_csv('https://github.com/huangpen77/BUDT704/raw/main/Chapter08/Summer%20Olympic%20medals/gold_top5.csv', index_col='Country')
display(bronze, silver, gold)

                 Total
Country
United States   1052.0
Soviet Union     584.0
United Kingdom   505.0
France           475.0
Germany          454.0

                 Total
Country
United States   1195.0
Soviet Union     627.0
United Kingdom   591.0
France           461.0
Italy            394.0

                 Total
Country
United States   2088.0
Soviet Union     838.0
United Kingdom   498.0
Italy            460.0
Germany          407.0

#### Instructions (1 point)

* Construct a list of DataFrames called `medal_list` with entries `bronze`, `silver`, and `gold`.
* Concatenate `medal_list` horizontally with an inner join to create `medals`.
    * Use the keyword argument `keys=['bronze', 'silver', 'gold']` to yield suitable hierarchical indexing.
    * Use `axis=1` to get horizontal concatenation.
    * Use `join='inner'` to keep only rows that share common index labels.

In [33]:
# Create the list of DataFrames: medal_list
medal_list = [bronze,silver,gold]

# Concatenate medal_list horizontally using an inner join: medals
medals = pd.concat(medal_list, keys=['bronze', 'silver', 'gold'], axis=1, join='inner')

# Print medals
medals

                bronze  silver    gold
                 Total   Total   Total
Country
United States   1052.0  1195.0  2088.0
Soviet Union     584.0   627.0   838.0
United Kingdom   505.0   591.0   498.0

### 2: Concatenating DataFrames with outer join

Now we will try dataframe concatenation using outer join on the same data.

#### Instructions (1 point)
* Concatenate `medal_list` horizontally with an inner join to create `medals`.
    * Use the keyword argument `keys=['bronze', 'silver', 'gold']` to yield suitable hierarchical indexing.
    * Use `axis=1` to get horizontal concatenation.
    * Use `join='outer'` to keep rows of all countries without repetition.

In [34]:
# Concatenate medal_list horizontally using an outer join: medals
medals = pd.concat(medal_list, keys=['bronze', 'silver', 'gold'], axis=1, join='outer')

# Print medals
medals

                bronze  silver    gold
                 Total   Total   Total
Country
United States   1052.0  1195.0  2088.0
Soviet Union     584.0   627.0   838.0
United Kingdom   505.0   591.0   498.0
France           475.0   461.0     NaN
Germany          454.0     NaN   407.0
Italy              NaN   394.0   460.0